spec/dummy/app/controllers/roles_controller.rb

  def create
    @role = Role.new roles_params

    if @role.save
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Admin"], ["created_at", "2015-02-23 19:59:48.414248"], ["updated_at", "2015-02-23 19:59:48.414248"]]